---
kind: property
id: P:Autodesk.Revit.DB.FilteredWorksetIdIterator.CurrentObject
source: html/c7261115-5ffa-6719-64f7-982d8d111793.htm
---
# Autodesk.Revit.DB.FilteredWorksetIdIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```